# ArrayMixedModAndViewSpecElemsWarning Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ArrayFailures..::..ArrayMixedModAndViewSpecElemsWarning Property
BuiltInFailures..::..ArrayFailures Class See Also
---
You have selected a mixture of modeling and view specific elements to array in an associative manner. Only the model elements will remain grouped and associative.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ArrayMixedModAndViewSpecElemsWarning { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ArrayMixedModAndViewSpecElemsWarning As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ArrayMixedModAndViewSpecElemsWarning {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ArrayFailures Class
Autodesk.Revit.DB Namespace